TexasInstruments/c2000ware-core-sdk/driverlib/f28p55x/examples/usb/usb_dev_comp/scistdio.h
//##############################################################################
//
// FILE:   scistdio.h
//
// TITLE:  Prototypes for the UART console functions.
//
//##############################################################################
//
//
// 
// C2000Ware v5.04.00.00
//
// Copyright (C) 2024 Texas Instruments Incorporated - http://www.ti.com
//
// Redistribution and use in source and binary forms, with or without 
// modification, are permitted provided that the following conditions 
// are met:
// 
//   Redistributions of source code must retain the above copyright 
//   notice, this list of conditions and the following disclaimer.
// 
//   Redistributions in binary form must reproduce the above copyright
//   notice, this list of conditions and the following disclaimer in the 
//   documentation and/or other materials provided with the   
//   distribution.
// 
//   Neither the name of Texas Instruments Incorporated nor the names of
//   its contributors may be used to endorse or promote products derived
//   from this software without specific prior written permission.
// 
// THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS 
// "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT 
// LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR
// A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT 
// OWNER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, 
// SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT 
// LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
// DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
// THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT 
// (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE 
// OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
// $
//##############################################################################

#ifndef SCISTDIO_H
#define SCISTDIO_H

//
// Included Files
//
#include "driverlib.h"
#include "device.h"
#include <stdbool.h>
#include <stdint.h>
#include <stdarg.h>

//*****************************************************************************
//
// If building with a C++ compiler, make all of the definitions in this header
// have a C binding.
//
//*****************************************************************************
#ifdef __cplusplus
extern "C"
{
#endif

//
// If built for buffered operation, the following labels define the sizes of
// the transmit and receive buffers respectively.
//
#ifdef UART_BUFFERED
#ifndef UART_RX_BUFFER_SIZE
#define UART_RX_BUFFER_SIZE     128
#endif
#ifndef UART_TX_BUFFER_SIZE
#define UART_TX_BUFFER_SIZE     1024
#endif
#endif

//
// Function Prototypes
//
extern void SCIStdioConfig(uint32_t ui32Port, uint32_t ui32Baud,
                           uint32_t ui32SrcClock);
extern void SCIprintf(const char *pcString, ...);
extern void SCIvprintf(const char *pcString, va_list vaArgP);
extern int SCIwrite(const char *pcBuf, uint32_t ui32Len);
extern void SCIHexDump(uint8_t *data, uint32_t size);

//*****************************************************************************
//
// Mark the end of the C bindings section for C++ compilers.
//
//*****************************************************************************
#ifndef LOG_LEVEL
    #define LOG_LEVEL 3
#endif

#if LOG_LEVEL > 2
    #define log_dbg(fmt,args...) \
        SCIprintf("[DEG]:"fmt"\r\n" ,##args)
#else
    #define log_dbg(fmt,args...)
#endif

#if LOG_LEVEL > 1
    #define log_info(fmt,args...) \
        SCIprintf("[INF]:"fmt"\r\n" ,##args)

    #define log_waring(fmt,args...) \
        SCIprintf("[WARN]"fmt"\r\n" ,##args)
#else
    #define log_info(fmt,args...)
    #define log_waring(fmt,args...)
#endif

#if LOG_LEVEL > 0
    #define log_err(fmt,args...) \
        SCIprintf("[ERR]"fmt"\r\n" ,##args)
#else
    #define log_err(fmt,args...)
#endif

#ifdef __cplusplus
}
#endif

#endif // SCISTDIO_H

//
// End of file
//
